updateservice-system-tests/updateservice-system-tests-service/src/test/resources/wiremock/forsrights/mappings/mapping-auth_dbc_with_ip_failure.json

{
  "request" : {
    "url" : "/",
    "method" : "POST",
    "bodyPatterns" : [ {
      "equalTo" : "<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><forsRightsRequest xmlns=\"http://oss.dbc.dk/ns/forsrights\"><userIdAut>netpunkt</userIdAut><groupIdAut>870970</groupIdAut><passwordAut>wrong_passwd</passwordAut><ipAddress>127.0.0.1</ipAddress></forsRightsRequest></S:Body></S:Envelope>"
    } ]
  },
  "response" : {
    "status" : 200,
    "bodyFileName" : "body-auth_failure.xml",
    "headers" : {
      "Date" : "Wed, 22 Oct 2014 12:41:51 GMT",
      "Server" : "Apache",
      "Content-Length" : "332",
      "Keep-Alive" : "timeout=15, max=100",
      "Connection" : "Keep-Alive",
      "Content-Type" : "text/xml"
    }
  }
}